#!/usr/bin/env python2.7
# coding: utf-8

root = 'D:/work/All_tv_logo/'
bin_n = 16
wc = 18
hc = 11
feature_size = 16*wc*hc+2
train_percent = 0.2
width_percent = 0.1
height_percent = 0.1
shape0 = (111,184)
size0 = (184,111)

# sample > 100
tv_names = ['Notv','兵团卫视','北京少儿','四川-康巴卫视','四川sctv-3','四川sctv-7','山东齐鲁','广东嘉佳卡通','广东影视','广东珠江','新疆13','湖北电视台','湖北经视','湖南电视剧','湖南经视','湖南金鹰卡通','辽宁都市','重庆-影视','东南卫视','东方卫视','云南卫视','内蒙古卫视','北京卫视','吉林卫视','四川卫视','天津卫视','宁夏卫视','安徽卫视','山东卫视','山西卫视','广东卫视','广西卫视','新疆兵团卫视','新疆卫视','江苏卫视','江西卫视','河北卫视','河南卫视','浙江卫视','深圳卫视','湖北卫视','湖南卫视','甘肃卫视','西藏卫视','贵州卫视','辽宁卫视','重庆卫视','陕西卫视','青海卫视','黑龙江卫视','CCTV-1','CCTV-10','CCTV-11','CCTV-12','CCTV-13','CCTV-14','CCTV-15','CCTV-2','CCTV-3','CCTV-4','CCTV-5','CCTV-6','CCTV-7','CCTV-8','CCTV-9']

# test_classifier.py
n_test = 1000









